; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	infrared1 - mode
	spectrograph2 - mode
	infrared3 - mode
	thermograph0 - mode
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation6 - direction
	Star4 - direction
	Star0 - direction
	Star5 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument3 infrared1)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star4)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument5 infrared1)
	(supports instrument5 infrared3)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star0)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
)
(:goal (and
	(pointing satellite1 Planet8)
	(pointing satellite2 Planet11)
	(have_image Planet7 spectrograph2)
	(have_image Planet8 thermograph0)
	(have_image Star9 spectrograph2)
	(have_image Star10 infrared3)
	(have_image Planet11 infrared1)
	(have_image Phenomenon12 infrared3)
	(have_image Planet13 spectrograph2)
	(have_image Star14 thermograph0)
	(have_image Phenomenon15 infrared1)
	(have_image Phenomenon16 thermograph0)
))

)

; plan
1. (turn_to satellite2 star0 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star0)
   goals met: 0 of 12
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 12
3. (calibrate satellite2 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 0 of 12
4. (turn_to satellite2 planet7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet7)
   goals met: 0 of 12
5. (take_image satellite2 planet7 instrument5 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 1 of 12
6. (turn_to satellite2 planet13 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet13)
   goals met: 1 of 12
7. (take_image satellite2 planet13 instrument5 spectrograph2)
   added: (have_image planet13 spectrograph2)
   goals met: 2 of 12
8. (turn_to satellite2 phenomenon15 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 phenomenon15)
   goals met: 2 of 12
9. (take_image satellite2 phenomenon15 instrument5 infrared1)
   added: (have_image phenomenon15 infrared1)
   goals met: 3 of 12
10. (turn_to satellite2 phenomenon12 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon12)
   goals met: 3 of 12
11. (turn_to satellite1 star4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star4)
   goals met: 3 of 12
12. (take_image satellite2 phenomenon12 instrument5 infrared3)
   added: (have_image phenomenon12 infrared3)
   goals met: 4 of 12
13. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 4 of 12
14. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 4 of 12
15. (turn_to satellite1 phenomenon16 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon16)
   goals met: 4 of 12
16. (take_image satellite1 phenomenon16 instrument3 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 5 of 12
17. (turn_to satellite1 star10 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star10)
   goals met: 5 of 12
18. (take_image satellite1 star10 instrument3 infrared3)
   added: (have_image star10 infrared3)
   goals met: 6 of 12
19. (turn_to satellite1 star14 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star14)
   goals met: 6 of 12
20. (take_image satellite1 star14 instrument3 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 7 of 12
21. (turn_to satellite1 planet8 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 planet8)
   goals met: 8 of 12
22. (take_image satellite1 planet8 instrument3 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 9 of 12
23. (turn_to satellite2 star9 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star9)
   goals met: 9 of 12
24. (take_image satellite2 star9 instrument5 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 10 of 12
25. (turn_to satellite2 planet11 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 planet11)
   goals met: 11 of 12
26. (take_image satellite2 planet11 instrument5 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 12 of 12
